Tekla.Structures.TeklaStructuresInternal.IEvents
Interface for the Events class allows the user to register event listeners for Tekla Structures events.
This interface allows the Marshaling of the Events class with Trimble.Remoting

Tekla.Structures.TeklaStructuresInternal.IEvents.TeklaStructuresExit
The TeklaStructuresExit event is raised just before Tekla Structures exits. After this event has been called
the user will no longer be able to perform any calls to Tekla Structures.

Tekla.Structures.TeklaStructuresInternal.IEvents.ModuleManagerUpdate
The ModuleManagerUpdate event.

Tekla.Structures.TeklaStructuresInternal.IEvents.OnTeklaStructuresExit(System.String,System.Object[])


Tekla.Structures.TeklaStructuresInternal.IEvents.OnModuleManagerUpdate


Tekla.Structures.TeklaStructuresInternal.IEvents.Register
Registers the instance to listen to the specified events.
More event delegates should not be added without calling UnRegister
first.

Tekla.Structures.TeklaStructuresInternal.IEvents.UnRegister
Unregisters the instance from listening to events.